<?php
#問題１
// 1
// 21
// 321
// for ($x = 2; $x >= 0; $x--) {//$xが初期値２から０になるまで１ずつマイナス縦軸
//     for ($y = 3; $y >= $x + 1; $y--) {//横軸
//         echo $y - $x;
//     }
//     echo "<br>";
// }

// 問題2
// ***1
// **121
// *12321
// 1234321
// for ($a = 1; $a <= 4; $a++) {
//     for (
//         $b = 3;
//         $b >= $a;
//         $b--
//     ) {
//         echo "*";
//     }
//     for ($c = 1; $c <= $a; $c++) {
//         echo $c;
//     }
//     for ($d = 3; $d >= 6 - $c; $d--) {
//         echo $d - (4 - $a);
//     }
//     echo "<br />";
// }
